ДО_ПЭС/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮрФизЛицо</name>
  <enumValues>
    <name>ЮрЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
</mdclass:Enum>

ДО_ПЭС/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
</mdclass:Enum>

ДО_ПЭС/src/Catalogs/ЕАЕ_ПредопределенныеЗначенияОбъектов/ЕАЕ_ПредопределенныеЗначенияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕАЕ_ПредопределенныеЗначенияОбъектов</name>
  <predefined>
    <items>
      <name>ВидВходДокументаВходПисьмоУФАС</name>
      <description>Вид входящего документа Вход письмо УФАС</description>
    </items>
    <items>
      <name>ВидВходДокументаВходящееПисьмо</name>
      <description>Вид входящего документа Входящее письмо</description>
    </items>
    <items>
      <name>ВидВходДокументаОбращениеОтГраждан</name>
      <description>Вид входящего документа Обращение от граждан</description>
    </items>
    <items>
      <name>ДопРеквАдресВходПисьмоУФАС</name>
      <description>Доп.реквизит Адрес (Входящее письмо от УФАС)</description>
    </items>
    <items>
      <name>ДопРеквАдресВходПисьмо</name>
      <description>Доп.реквизит Адрес (Входящее письмо)</description>
    </items>
    <items>
      <name>ДопРеквАдресВходПисьмоОбращение</name>
      <description>Доп.реквизит Адрес (Обращение от граждан)</description>
    </items>
    <items>
      <name>ДопРеквУРЭЭПодписДирПоЭнергосбДеят</name>
      <description>Доп.реквизит Исходящие документы УРЭЭ подписывает директор по энергосбытовой деятельност</description>
    </items>
    <items>
      <name>ДопРеквНормоконтроль</name>
      <description>Доп.реквизит Нормоконтроль (Исходящие документы)</description>
    </items>
    <items>
      <name>ДопРеквОтправкаЧерезДелопроизв</name>
      <description>Доп.реквизит Отправка через делопроизводителя (Исходящее письмо)</description>
    </items>
    <items>
      <name>ДопРеквПолноеИмяИОтчество</name>
      <description>Доп.реквизит Полное имя и отчество (Контактные лица)</description>
    </items>
    <items>
      <name>ПодразделениеГубахинскоеОтделение</name>
      <description>Подразделение Губахинское отделение</description>
    </items>
    <items>
      <name>ПодразделениеЗакамскоеОтделение</name>
      <description>Подразделение Закамское отделение</description>
    </items>
    <items>
      <name>ПодразделениеКудымкарскоеОтделение</name>
      <description>Подразделение Кудымкарское отделение</description>
    </items>
    <items>
      <name>ПодразделениеКунгурскоеОтделение</name>
      <description>Подразделение Кунгурское отделение</description>
    </items>
    <items>
      <name>ПодразделениеМотовилихинскоеОтделение</name>
      <description>Подразделение Мотовилихинское отделение</description>
    </items>
    <items>
      <name>ПодразделениеОтделение</name>
      <description>Подразделение Отделение</description>
    </items>
    <items>
      <name>ПодразделениеОчерскоеОтделение</name>
      <description>Подразделение Очерское отделение</description>
    </items>
    <items>
      <name>ПодразделениеСеверноеОтделение</name>
      <description>Подразделение Северное отделение</description>
    </items>
    <items>
      <name>ПодразделениеУРЭЭ</name>
      <description>Подразделение УРЭЭ</description>
    </items>
    <items>
      <name>ПодразделениеЦентральноеОтделение</name>
      <description>Подразделение Центральное отделение</description>
    </items>
    <items>
      <name>ПодразделениеЧусовскоеОтделение</name>
      <description>Подразделение Чусовское отделение</description>
    </items>
    <items>
      <name>ПодразделениеЮжноеОтделение</name>
      <description>Подразделение Южное отделение</description>
    </items>
    <items>
      <name>ПолнаяРольДиректорПоНаправлению</name>
      <description>Полная роль Директор по направлению, Заместитель генерального директора - директор по сбытовой деяте</description>
    </items>
    <items>
      <name>ПолнаяРольНачальникУРЭ</name>
      <description>Полная роль Начальник управления реализации электроэнергии</description>
    </items>
  </predefined>
</mdclass:Catalog>

ДО_ПЭС/src/CommonModules/ЕАЕ_Делопроизводство/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ВНУТРЕННИМИ, ВХОДЯЩИМИ И ИСХОДЯЩИМИ ДОКУМЕНТАМИ
// 

#Область ПрограммныйИнтерфейс

// Функция - Получить адрес контрагента
//
// Параметры:
//  Контрагент	 - Справочник.Контрагенты - Контрагент по которому необходимо получить адрес
// 
// Возвращаемое значение:
//   Представление - Строка - Адрес контрагента
//
Функция ПолучитьАдресКонтрагента(Контрагент) Экспорт
	
	КонтрагентФизЛицо = Ложь;
	Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		КонтрагентФизЛицо = Истина;
		Контрагент = Контрагент.ФизЛицо;
	КонецЕсли;
	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Представление КАК Представление
	               |ИЗ
	               |	Справочник.";
	Если КонтрагентФизЛицо Тогда 
		Текст = Текст + "ФизическиеЛица."; 
	Иначе
		Текст = Текст + "Контрагенты."; 
	КонецЕсли;
	Текст = Текст +  "КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Ссылка = &Ссылка
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтактнаяИнформация.ДействуетС УБЫВ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	 
	Если КонтрагентФизЛицо Тогда
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ДомашнийАдресФизическогоЛица);
	Иначе 
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить();
	Если НЕ Выборка.Пустой() Тогда
		ВыборкаКонтрагента = Выборка.Выбрать();
		ВыборкаКонтрагента.Следующий(); 
		
		Возврат ВыборкаКонтрагента.Представление;
		
	КонецЕсли;
	
	Возврат "";
		
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить доп реквизит адрес контрагента
//  
// Параметры:
//  Параметры - Структура
//              ВидДокумента - Справочник.ВидыВнутреннихДокументов,  
//								ВидыВходящихДокументов,  
//								ВидыИсходящихДокументов   
//              Контрагент - Справочник.Контрагенты
//
//  СписокДопРеквизитов	 - 	Список доп.реквизитов Справочник.ВнутренниеДокументы, 
//													ВходящиеДокументы, 
//													ИсходящиеДокументы - документа, по которому требуется заполнить доп.реквизит Адрес   
// Возвращаемое значение:
//   Соответствие:
//        Ключ - НаименованиеРеквизита 
//        Значение - АдресКонтрагента
//
Функция ПолучитьДопРеквизитАдресКонтрагента(Параметры, СписокДопРеквизитов) Экспорт
	Соответствие = Новый Соответствие();
	
	ВидДокументаВходящееПисьмо = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ВидВходДокументаВходящееПисьмо);
	ВидДокументаВходящееПисьмоУФАС = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ВидВходДокументаВходПисьмоУФАС);
	ВидДокументаОбращениеОтГраждан = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ВидВходДокументаОбращениеОтГраждан);
	
	Если Параметры.ВидДокумента = ВидДокументаВходящееПисьмо Тогда
		Свойство = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ДопРеквАдресВходПисьмо);
	ИначеЕсли Параметры.ВидДокумента =  ВидДокументаВходящееПисьмоУФАС Тогда
		Свойство = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ДопРеквАдресВходПисьмоУФАС);
	ИначеЕсли Параметры.ВидДокумента =  ВидДокументаОбращениеОтГраждан Тогда
		Свойство = ЕАЕ_ОбщегоНазначенияСерверПовтИсп.ПолучитьСсылкуПоПредопределенномуОбъекту(Справочники.ЕАЕ_ПредопределенныеЗначенияОбъектов.ДопРеквАдресВходПисьмоОбращение);
	Иначе Свойство = Неопределено;
	КонецЕсли;
	
	Если НЕ Свойство = Неопределено Тогда
		НайденныеСтроки = СписокДопРеквизитов.НайтиСтроки(Новый Структура("Свойство", Свойство));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НаименованиеРеквизита = НайденныеСтроки[0].ИмяРеквизитаЗначение;
			Соответствие.Вставить(НаименованиеРеквизита, ПолучитьАдресКонтрагента(Параметры.Контрагент));
		КонецЕсли; 		
	КонецЕсли;

	Возврат Соответствие;
	
КонецФункции

#КонецОбласти
